# <---------- Message converter ---------->
boolToRussian = {
	True: 'да',
	False: 'нет'
}


# <---------- Messages ---------->
startOrHelp = ['/start', '/help', 'старт', 'помощь', 'начало', 'хелп', 'start', 'begin', 'help', '⚙️ помощь', '⚙️ help']

groupPanel = ['👥 группа', 'группа', 'група', 'класс', 'group', 'class', '👥 group', '/group', '/class']

groupRegistration = ['создать группу', 'создать групу', 'create group']

groupEntry = ['войти в группу', 'войти в групу', 'enter group', 'group entry', 'вход в группу']

homeworkShow = ['покажи дз', 'дз', '/hw', '📝 домашнее задание']

FSM_cancel = ['отмена', '❌ отмена', 'стоп', 'хватит', '/отмена', '/стоп', '/хватит', 'cancel', 'reject', 'stop', '❌ stop', '/stop', '/cancel', '/reject', 'отмена ❌']

weekdays = ['понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота', 'воскресенье']
weekdays_smol = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс']
weekdays_accusativeCase = ['понедельник', 'вторник', 'среду', 'четверг', 'пятницу', 'субботу', 'воскресенье']

months = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']
months_genitive = ['Января', 'Февраля', 'Марта', 'Апреля', 'Мая', 'Июня', 'Июля', 'Августа', 'Сентября', 'Октября', 'Ноября', 'Декабря']

hw_keywords = ('домашнее задание', 'домашка по', 'задание по', 'дз')

mainScheduleApprove = ['MainSchedule_Submit', 'MainSchedule_Decline']

mainScheduleDays = ['MainSchedule_Days4', 'MainSchedule_Days5']

filter_chars = r'/.,!;:@#$%^&*()-_=+{[]}`~<>?'
